tiborsimon/embedded-tdd-headers/pic/pic18/pic18c858_tdd.h
#define TXB2CON_TXERR                 522
#define TXB2CON_TXLARB                523
#define TXB2LARB                      524
#define TXB2ABT                       525
#define TXB2CON_TXABT                 526
#define TXB2SIDH                      527
#define TXB2SID3                      528
#define TXB2SIDH_SID3                 529
#define TXB2SID4                      530
#define TXB2SIDH_SID4                 531
#define TXB2SID5                      532
#define TXB2SIDH_SID5                 533
#define TXB2SID6                      534
#define TXB2SIDH_SID6                 535
#define TXB2SID7                      536
#define TXB2SIDH_SID7                 537
#define TXB2SID8                      538
#define TXB2SIDH_SID8                 539
#define TXB2SID9                      540
#define TXB2SIDH_SID9                 541
#define TXB2SIDH_SID10                542
#define TXB2SID10                     543
#define TXB2SIDL                      544
#define TXB2SIDL_EID16                545
#define TXB2EID16                     546
#define TXB2SIDL_EID17                547
#define TXB2EID17                     548
#define TXB2SIDL_EXIDE                549
#define TXB2EXIDE                     550
#define TXB2SIDL_EXID                 551
#define TXB2SIDL_SID0                 552
#define TXB2SID0                      553
#define TXB2SIDL_SID1                 554
#define TXB2SID1                      555
#define TXB2SIDL_SID2                 556
#define TXB2SID2                      557
#define TXB2EIDH                      558
#define TXB2EIDH_EID8                 559
#define TXB2EID8                      560
#define TXB2EIDH_EID9                 561
#define TXB2EID9                      562
#define TXB2EIDH_EID10                563
#define TXB2EID10                     564
#define TXB2EIDH_EID11                565
#define TXB2EID11                     566
#define TXB2EIDH_EID12                567
#define TXB2EID12                     568
#define TXB2EIDH_EID13                569
#define TXB2EID13                     570
#define TXB2EIDH_EID14                571
#define TXB2EID14                     572
#define TXB2EIDH_EID15                573
#define TXB2EID15                     574
#define TXB2EIDL                      575
#define TXB2EID0                      576
#define TXB2EIDL_EID0                 577
#define TXB2EID1                      578
#define TXB2EIDL_EID1                 579
#define TXB2EID2                      580
#define TXB2EIDL_EID2                 581
#define TXB2EID3                      582
#define TXB2EIDL_EID3                 583
#define TXB2EID4                      584
#define TXB2EIDL_EID4                 585
#define TXB2EID5                      586
#define TXB2EIDL_EID5                 587
#define TXB2EID6                      588
#define TXB2EIDL_EID6                 589
#define TXB2EID7                      590
#define TXB2EIDL_EID7                 591
#define TXB2DLC                       592
#define TXB2DLC0                      593
#define TXB2DLC_DLC0                  594
#define TXB2DLC1                      595
#define TXB2DLC_DLC1                  596
#define TXB2DLC2                      597
#define TXB2DLC_DLC2                  598
#define TXB2DLC_DLC3                  599
#define TXB2DLC3                      600
#define TXB2DLC_TXRTR                 601
#define TXB2DLC_RTR                   602
#define TXB2RTR                       603
#define TXB2D0                        604
#define TXB2D00                       605
#define TXB2D01                       606
#define TXB2D02                       607
#define TXB2D03                       608
#define TXB2D04                       609
#define TXB2D05                       610
#define TXB2D06                       611
#define TXB2D07                       612
#define TXB2D1                        613
#define TXB2D10                       614
#define TXB2D11                       615
#define TXB2D12                       616
#define TXB2D13                       617
#define TXB2D14                       618
#define TXB2D15                       619
#define TXB2D16                       620
#define TXB2D17                       621
#define TXB2D2                        622
#define TXB2D20                       623
#define TXB2D21                       624
#define TXB2D22                       625
#define TXB2D23                       626
#define TXB2D24                       627
#define TXB2D25                       628
#define TXB2D26                       629
#define TXB2D27                       630
#define TXB2D3                        631
#define TXB2D30                       632
#define TXB2D31                       633
#define TXB2D32                       634
#define TXB2D33                       635
#define TXB2D34                       636
#define TXB2D35                       637
#define TXB2D36                       638
#define TXB2D37                       639
#define TXB2D4                        640
#define TXB2D40                       641
#define TXB2D41                       642
#define TXB2D42                       643
#define TXB2D43                       644
#define TXB2D44                       645
#define TXB2D45                       646
#define TXB2D46                       647
#define TXB2D47                       648
#define TXB2D5                        649
#define TXB2D50                       650
#define TXB2D51                       651
#define TXB2D52                       652
#define TXB2D53                       653
#define TXB2D54                       654
#define TXB2D55                       655
#define TXB2D56                       656
#define TXB2D57                       657
#define TXB2D6                        658
#define TXB2D60                       659
#define TXB2D61                       660
#define TXB2D62                       661
#define TXB2D63                       662
#define TXB2D64                       663
#define TXB2D65                       664
#define TXB2D66                       665
#define TXB2D67                       666
#define TXB2D7                        667
#define TXB2D70                       668
#define TXB2D71                       669
#define TXB2D72                       670
#define TXB2D73                       671
#define TXB2D74                       672
#define TXB2D75                       673
#define TXB2D76                       674
#define TXB2D77                       675
#define CANSTATRO3                    676
#define CANSTATRO3_ICODE0             677
#define CANSTATRO3_ICODE1             678
#define CANSTATRO3_ICODE2             679
#define CANSTATRO3_OPMODE0            680
#define CANSTATRO3_OPMODE1            681
#define CANSTATRO3_OPMODE2            682
#define TXB1CON                       683
#define TXB1PRI0                      684
#define TXB1CON_TXPRI0                685
#define TXB1PRI1                      686
#define TXB1CON_TXPRI1                687
#define TXB1CON_TXREQ                 688
#define TXB1REQ                       689
#define TXB1CON_TXERR                 690
#define TXB1ERR                       691
#define TXB1CON_TXLARB                692
#define TXB1LARB                      693
#define TXB1ABT                       694
#define TXB1CON_TXABT                 695
#define TXB1SIDH                      696
#define TXB1SIDH_SID3                 697
#define TXB1SID3                      698
#define TXB1SIDH_SID4                 699
#define TXB1SID4                      700
#define TXB1SIDH_SID5                 701
#define TXB1SID5                      702
#define TXB1SIDH_SID6                 703
#define TXB1SID6                      704
#define TXB1SIDH_SID7                 705
#define TXB1SID7                      706
#define TXB1SIDH_SID8                 707
#define TXB1SID8                      708
#define TXB1SIDH_SID9                 709
#define TXB1SID9                      710
#define TXB1SID10                     711
#define TXB1SIDH_SID10                712
#define TXB1SIDL                      713
#define TXB1SIDL_EID16                714
#define TXB1EID16                     715
#define TXB1SIDL_EID17                716
#define TXB1EID17                     717
#define TXB1EXIDE                     718
#define TXB1SIDL_EXIDE                719
#define TXB1SIDL_EXID                 720
#define TXB1SID0                      721
#define TXB1SIDL_SID0                 722
#define TXB1SID1                      723
#define TXB1SIDL_SID1                 724
#define TXB1SID2                      725
#define TXB1SIDL_SID2                 726
#define TXB1EIDH                      727
#define TXB1EID8                      728
#define TXB1EIDH_EID8                 729
#define TXB1EID9                      730
#define TXB1EIDH_EID9                 731
#define TXB1EID10                     732
#define TXB1EIDH_EID10                733
#define TXB1EID11                     734
#define TXB1EIDH_EID11                735
#define TXB1EID12                     736
#define TXB1EIDH_EID12                737
#define TXB1EID13                     738
#define TXB1EIDH_EID13                739
#define TXB1EID14                     740
#define TXB1EIDH_EID14                741
#define TXB1EID15                     742
#define TXB1EIDH_EID15                743
#define TXB1EIDL                      744
#define TXB1EIDL_EID0                 745
#define TXB1EID0                      746
#define TXB1EIDL_EID1                 747
#define TXB1EID1                      748
#define TXB1EIDL_EID2                 749
#define TXB1EID2                      750
#define TXB1EIDL_EID3                 751
#define TXB1EID3                      752
#define TXB1EIDL_EID4                 753
#define TXB1EID4                      754
#define TXB1EIDL_EID5                 755
#define TXB1EID5                      756
#define TXB1EIDL_EID6                 757
#define TXB1EID6                      758
#define TXB1EIDL_EID7                 759
#define TXB1EID7                      760
#define TXB1DLC                       761
#define TXB1DLC0                      762
#define TXB1DLC_DLC0                  763
#define TXB1DLC_DLC1                  764
#define TXB1DLC1                      765
#define TXB1DLC_DLC2                  766
#define TXB1DLC2                      767
#define TXB1DLC3                      768
#define TXB1DLC_DLC3                  769
#define TXB1RTR                       770
#define TXB1DLC_RTR                   771
#define TXB1DLC_TXRTR                 772
#define TXB1D0                        773
#define TXB1D00                       774
#define TXB1D01                       775
#define TXB1D02                       776
#define TXB1D03                       777
#define TXB1D04                       778
#define TXB1D05                       779
#define TXB1D06                       780
#define TXB1D07                       781
#define TXB1D1                        782
#define TXB1D10                       783
#define TXB1D11                       784
#define TXB1D12                       785
#define TXB1D13                       786
#define TXB1D14                       787
#define TXB1D15                       788
#define TXB1D16                       789
#define TXB1D17                       790
#define TXB1D2                        791
#define TXB1D20                       792
#define TXB1D21                       793
#define TXB1D22                       794
#define TBB1D23                       795
#define TXB1D23                       796
#define TXB1D24                       797
#define TXB1D25                       798
#define TXB1D26                       799
#define TXB1D27                       800
#define TXB1D3                        801
#define TXB1D30                       802
#define TXB1D31                       803
#define TXB1D32                       804
#define TXB1D33                       805
#define TXB1D34                       806
#define TXB1D35                       807
#define TXB1D36                       808
#define TXB1D37                       809
#define TXB1D4                        810
#define TXB1D40                       811
#define TXB1D41                       812
#define TXB1D42                       813
#define TXB1D43                       814
#define TXB1D44                       815
#define TXB1D45                       816
#define TXB1D46                       817
#define TXB1D47                       818
#define TXB1D5                        819
#define TXB1D50                       820
#define TXB1D51                       821
#define TXB1D52                       822
#define TXB1D53                       823
#define TXB1D54                       824
#define TXB1D55                       825
#define TXB1D56                       826
#define TXB1D57                       827
#define TXB1D6                        828
#define TXB1D60                       829
#define TXB1D61                       830
#define TXB1D62                       831
#define TXB1D63                       832
#define TXB1D64                       833
#define TXB1D65                       834
#define TXB1D66                       835
#define TXB1D67                       836
#define TXB1D7                        837
#define TXB1D70                       838
#define TXB1D71                       839
#define TXB1D72                       840
#define TXB1D73                       841
#define TXB1D74                       842
#define TXB1D75                       843
#define TXB1D76                       844
#define TXB1D77                       845
#define CANSTATRO2                    846
#define CANSTATRO2_ICODE0             847
#define CANSTATRO2_ICODE1             848
#define CANSTATRO2_ICODE2             849
#define CANSTATRO2_OPMODE0            850
#define CANSTATRO2_OPMODE1            851
#define CANSTATRO2_OPMODE2            852
#define TXB0CON                       853
#define TXB0PRI0                      854
#define TXB0CON_TXPRI0                855
#define TXB0CON_TXPRI1                856
#define TXB0PRI1                      857
#define TXB0REQ                       858
#define TXB0CON_TXREQ                 859
#define TXB0CON_TXERR                 860
#define TXB0ERR                       861
#define TXB0CON_TXLARB                862
#define TXB0LARB                      863
#define TXB0ABT                       864
#define TXB0CON_TXABT                 865
#define TXB0SIDH                      866
#define TXB0SID3                      867
#define TXB0SIDH_SID3                 868
#define TXB0SID4                      869
#define TXB0SIDH_SID4                 870
#define TXB0SID5                      871
#define TXB0SIDH_SID5                 872
#define TXB0SID6                      873
#define TXB0SIDH_SID6                 874
#define TXB0SID7                      875
#define TXB0SIDH_SID7                 876
#define TXB0SID8                      877
#define TXB0SIDH_SID8                 878
#define TXB0SID9                      879
#define TXB0SIDH_SID9                 880
#define TXB0SIDH_SID10                881
#define TXB0SID10                     882
#define TXB0SIDL                      883
#define TXB0EID16                     884
#define TXB0SIDL_EID16                885
#define TXB0EID17                     886
#define TXB0SIDL_EID17                887
#define TXB0SIDL_EXID                 888
#define TXB0SIDL_EXIDEN               889
#define TXB0EXIDE                     890
#define TXB0SID0                      891
#define TXB0SIDL_SID0                 892
#define TXB0SID1                      893
#define TXB0SIDL_SID1                 894
#define TXB0SID2                      895
#define TXB0SIDL_SID2                 896
#define TXB0EIDH                      897
#define TXB0EID8                      898
#define TXB0EIDH_EID8                 899
#define TXB0EID9                      900
#define TXB0EIDH_EID9                 901
#define TXB0EIDH_EID10                902
#define TXB0EID10                     903
#define TXB0EID11                     904
#define TXB0EIDH_EID11                905
#define TXB0EIDH_EID12                906
#define TXB0EID12                     907
#define TXB0EIDH_EID13                908
#define TXB0EID13                     909
#define TXB0EIDH_EID14                910
#define TXB0EID14                     911
#define TXB0EIDH_EID15                912
#define TXB0EID15                     913
#define TXB0EIDL                      914
#define TXB0EIDL_EID0                 915
#define TXB0EID0                      916
#define TXB0EIDL_EID1                 917
#define TXB0EID1                      918
#define TXB0EIDL_EID2                 919
#define TXB0EID2                      920
#define TXB0EIDL_EID3                 921
#define TXB0EID3                      922
#define TXB0EIDL_EID4                 923
#define TXB0EID4                      924
#define TXB0EIDL_EID5                 925
#define TXB0EID5                      926
#define TXB0EIDL_EID6                 927
#define TXB0EID6                      928
#define TXB0EIDL_EID7                 929
#define TXB0EID7                      930
#define TXB0DLC                       931
#define TXB0DLC0                      932
#define TXB0DLC_DLC0                  933
#define TXB0DLC1                      934
#define TXB0DLC_DLC1                  935
#define TXB0DLC2                      936
#define TXB0DLC_DLC2                  937
#define TXB0DLC3                      938
#define TXB0DLC_DLC3                  939
#define TXB0DLC_TXRTR                 940
#define TXB0RTR                       941
#define TXB0DLC_RTR                   942
#define TXB0D0                        943
#define TXB0D00                       944
#define TXB0D01                       945
#define TXB0D02                       946
#define TXB0D03                       947
#define TXB0D04                       948
#define TXB0D05                       949
#define TXB0D06                       950
#define TXB0D07                       951
#define TXB0D1                        952
#define TXB0D10                       953
#define TXB0D11                       954
#define TXB0D12                       955
#define TXB0D13                       956
#define TXB0D14                       957
#define TXB0D15                       958
#define TXB0D16                       959
#define TXB0D17                       960
#define TXB0D2                        961
#define TXB0D20                       962
#define TXB0D21                       963
#define TXB0D22                       964
#define TXB0D23                       965
#define TXB0D24                       966
#define TXB0D25                       967
#define TXB0D26                       968
#define TXB0D27                       969
#define TXB0D3                        970
#define TXB0D30                       971
#define TXB0D31                       972
#define TXB0D32                       973
#define TXB0D33                       974
#define TXB0D34                       975
#define TXB0D35                       976
#define TXB0D36                       977
#define TXB0D37                       978
#define TXB0D4                        979
#define TXB0D40                       980
#define TXB0D41                       981
#define TXB0D42                       982
#define TXB0D43                       983
#define TXB0D44                       984
#define TXB0D45                       985
#define TXB0D46                       986
#define TXB0D47                       987
#define TXB0D5                        988
#define TXB0D50                       989
#define TXB0D51                       990
#define TXB0D52                       991
#define TXB0D53                       992
#define TXB0D54                       993
#define TXB0D55                       994
#define TXB0D56                       995
#define TXB0D57                       996
#define TXB0D6                        997
#define TXB0D60                       998
#define TXB0D61                       999
#define TXB0D62                       1000
#define TXB0D63                       1001
#define TXB0D64                       1002
#define TXB0D65                       1003
#define TXB0D66                       1004
#define TXB0D67                       1005
#define TXB0D7                        1006
#define TXB0D70                       1007
#define TXB0D71                       1008
#define TXB0D72                       1009
#define TXB0D73                       1010
#define TXB0D74                       1011
#define TXB0D75                       1012
#define TXB0D76                       1013
#define TXB0D77                       1014
#define CANSTATRO1                    1015
#define CANSTATRO1_ICODE0             1016
#define CANSTATRO1_ICODE1             1017
#define CANSTATRO1_ICODE2             1018
#define CANSTATRO1_OPMODE0            1019
#define CANSTATRO1_OPMODE1            1020
#define CANSTATRO1_OPMODE2            1021
#define RXB1CON                       1022
#define RXB1FILHIT0                   1023
#define RXB1CON_FILHIT0               1024
#define RXB1FILHIT1                   1025
#define FILHIT1                       1026
#define RXB1FILHIT2                   1027
#define FILHIT2                       1028
#define RXB1FILHIT3                   1029
#define RXB1RTRR0                     1030
#define RXB1CON_RXRTRRO               1031
#define RXB1RTRRO                     1032
#define RXB1CON_RXM0                  1033
#define RXB1M0                        1034
#define RXB1M1                        1035
#define RXB1CON_RXM1                  1036
#define RXB1CON_RXFUL                 1037
#define RXB1FUL                       1038
#define RXB1SIDH                      1039
#define RXB1SID3                      1040
#define RXB1SIDH_SID3                 1041
#define RXB1SID4                      1042
#define RXB1SIDH_SID4                 1043
#define RXB1SID5                      1044
#define RXB1SIDH_SID5                 1045
#define RXB1SID6                      1046
#define RXB1SIDH_SID6                 1047
#define RXB1SID7                      1048
#define RXB1SIDH_SID7                 1049
#define RXB1SID8                      1050
#define RXB1SIDH_SID8                 1051
#define RXB1SID9                      1052
#define RXB1SIDH_SID9                 1053
#define RXB1SIDH_SID10                1054
#define RXB1SID10                     1055
#define RXB1SIDL                      1056
#define RXB1SIDL_EID16                1057
#define RXB1EID16                     1058
#define RXB1SIDL_EID17                1059
#define RXB1EID17                     1060
#define RXB1EXID                      1061
#define RXB1SIDL_EXID                 1062
#define RXB1SRR                       1063
#define RXB1SIDL_SRR                  1064
#define RXB1SID0                      1065
#define RXB1SIDL_SID0                 1066
#define RXB1SIDL_SID1                 1067
#define RXB1SID1                      1068
#define RXB1SIDL_SID2                 1069
#define RXB1SID2                      1070
#define RXB1EIDH                      1071
#define RXB1EID8                      1072
#define RXB1EIDH_EID8                 1073
#define RXB1EID9                      1074
#define RXB1EIDH_EID9                 1075
#define RXB1EIDH_EID10                1076
#define RXB1EID10                     1077
#define RXB1EIDH_EID11                1078
#define RXB1EID11                     1079
#define RXB1EIDH_EID12                1080
#define RXB1EID12                     1081
#define RXB1EID13                     1082
#define RXB1EIDH_EID13                1083
#define RXB1EIDH_EID14                1084
#define RXB1EID14                     1085
#define RXB1EIDH_EID15                1086
#define RXB1EID15                     1087
#define RXB1EIDL                      1088
#define RXB1EIDL_EID0                 1089
#define RXB1EID0                      1090
