tiborsimon/embedded-tdd-headers/pic/pic18/pic18c858_tdd.h
#define PORTE_RE0                     1649
#define WRE                           1650
#define NOT_WR                        1651
#define nWR                           1652
#define PORTE_RE1                     1653
#define PC2                           1654
#define nCS                           1655
#define NOT_CS                        1656
#define CCP10                         1657
#define PB2                           1658
#define CS                            1659
#define PORTE_RE2                     1660
#define CCP9E                         1661
#define PORTE_RE3                     1662
#define PC3E                          1663
#define PB3E                          1664
#define PORTE_RE4                     1665
#define CCP8E                         1666
#define CCP7E                         1667
#define PORTE_RE5                     1668
#define PC1E                          1669
#define CCP6E                         1670
#define PORTE_RE6                     1671
#define PB1E                          1672
#define PORTE_CCP2                    1673
#define CCP2E                         1674
#define PORTE_RE7                     1675
#define PA2E                          1676
#define PORTF                         1677
#define PORTF_RF0                     1678
#define PORTF_AN5                     1679
#define PORTF_RF1                     1680
#define C2OUTF                        1681
#define AN6                           1682
#define PORTF_RF2                     1683
#define AN7                           1684
#define C1OUTF                        1685
#define PORTF_RF3                     1686
#define AN8                           1687
#define PORTF_RF4                     1688
#define AN9                           1689
#define PORTF_RF5                     1690
#define AN10                          1691
#define PORTF_RF6                     1692
#define AN11                          1693
#define PORTF_RF7                     1694
#define PORTG                         1695
#define CANTX1                        1696
#define PORTG_RG0                     1697
#define PORTG_RG1                     1698
#define C3OUTG                        1699
#define CANTX2                        1700
#define CANRX                         1701
#define PORTG_RG2                     1702
#define PORTG_RG3                     1703
#define PORTG_RG4                     1704
#define PORTH                         1705
#define PORTH_RH0                     1706
#define PORTH_RH1                     1707
#define PORTH_RH2                     1708
#define PORTH_RH3                     1709
#define PORTH_RH4                     1710
#define CCP9                          1711
#define PC3                           1712
#define AN12                          1713
#define PORTH_RH5                     1714
#define CCP8                          1715
#define PB3                           1716
#define AN13                          1717
#define PORTH_RH6                     1718
#define CCP7                          1719
#define PC1                           1720
#define AN14                          1721
#define PORTH_RH7                     1722
#define CCP6                          1723
#define PB1                           1724
#define AN15                          1725
#define PORTJ                         1726
#define PORTJ_RJ0                     1727
#define PORTJ_RJ1                     1728
#define PORTJ_RJ2                     1729
#define PORTJ_RJ3                     1730
#define PORTJ_RJ4                     1731
#define PORTJ_RJ5                     1732
#define PORTJ_RJ6                     1733
#define PORTJ_RJ7                     1734
#define LATA                          1735
#define LATA0                         1736
#define LA0                           1737
#define LATA1                         1738
#define LA1                           1739
#define LATA2                         1740
#define LA2                           1741
#define LATA3                         1742
#define LA3                           1743
#define LATA4                         1744
#define LA4                           1745
#define LATA5                         1746
#define LA5                           1747
#define LATA6                         1748
#define LA6                           1749
#define LATB                          1750
#define LB0                           1751
#define LATB0                         1752
#define LB1                           1753
#define LATB1                         1754
#define LB2                           1755
#define LATB2                         1756
#define LB3                           1757
#define LATB3                         1758
#define LB4                           1759
#define LATB4                         1760
#define LB5                           1761
#define LATB5                         1762
#define LB6                           1763
#define LATB6                         1764
#define LB7                           1765
#define LATB7                         1766
#define LATC                          1767
#define LATC0                         1768
#define LC0                           1769
#define LATC1                         1770
#define LC1                           1771
#define LATC2                         1772
#define LC2                           1773
#define LATC3                         1774
#define LC3                           1775
#define LATC4                         1776
#define LC4                           1777
#define LATC5                         1778
#define LC5                           1779
#define LATC6                         1780
#define LC6                           1781
#define LATC7                         1782
#define LC7                           1783
#define LATD                          1784
#define LATD0                         1785
#define LD0                           1786
#define LATD1                         1787
#define LD1                           1788
#define LATD2                         1789
#define LD2                           1790
#define LATD3                         1791
#define LD3                           1792
#define LATD4                         1793
#define LD4                           1794
#define LATD5                         1795
#define LD5                           1796
#define LATD6                         1797
#define LD6                           1798
#define LATD7                         1799
#define LD7                           1800
#define LATE                          1801
#define LATE0                         1802
#define LE0                           1803
#define LATE1                         1804
#define LE1                           1805
#define LATE2                         1806
#define LE2                           1807
#define LATE3                         1808
#define LE3                           1809
#define LATE4                         1810
#define LE4                           1811
#define LATE5                         1812
#define LE5                           1813
#define LATE6                         1814
#define LE6                           1815
#define LATE7                         1816
#define LE7                           1817
#define LATF                          1818
#define LATF0                         1819
#define LF0                           1820
#define LATF1                         1821
#define LF1                           1822
#define LF2                           1823
#define LATF2                         1824
#define LF3                           1825
#define LATF3                         1826
#define LF4                           1827
#define LATF4                         1828
#define LF5                           1829
#define LATF5                         1830
#define LF6                           1831
#define LATF6                         1832
#define LF7                           1833
#define LATF7                         1834
#define LATG                          1835
#define LATG0                         1836
#define LG0                           1837
#define LATG1                         1838
#define LG1                           1839
#define LATG2                         1840
#define LG2                           1841
#define LATG3                         1842
#define LG3                           1843
#define LATG4                         1844
#define LG4                           1845
#define LATH                          1846
#define LH0                           1847
#define LATH0                         1848
#define LH1                           1849
#define LATH1                         1850
#define LH2                           1851
#define LATH2                         1852
#define LH3                           1853
#define LATH3                         1854
#define LH4                           1855
#define LATH4                         1856
#define LH5                           1857
#define LATH5                         1858
#define LH6                           1859
#define LATH6                         1860
#define LH7                           1861
#define LATH7                         1862
#define LATJ                          1863
#define LATJ0                         1864
#define LJ0                           1865
#define LATJ1                         1866
#define LJ1                           1867
#define LATJ2                         1868
#define LJ2                           1869
#define LATJ3                         1870
#define LJ3                           1871
#define LATJ4                         1872
#define LJ4                           1873
#define LATJ5                         1874
#define LJ5                           1875
#define LATJ6                         1876
#define LJ6                           1877
#define LATJ7                         1878
#define LJ7                           1879
#define TRISA                         1880
#define TRISA_RA0                     1881
#define TRISA0                        1882
#define TRISA_RA1                     1883
#define TRISA1                        1884
#define TRISA2                        1885
#define TRISA_RA2                     1886
#define TRISA_RA3                     1887
#define TRISA3                        1888
#define TRISA_RA4                     1889
#define TRISA4                        1890
#define TRISA_RA5                     1891
#define TRISA5                        1892
#define TRISA_RA6                     1893
#define TRISA6                        1894
#define TRISB                         1895
#define TRISB_RB0                     1896
#define TRISB0                        1897
#define TRISB_RB1                     1898
#define TRISB1                        1899
#define TRISB_RB2                     1900
#define TRISB2                        1901
#define TRISB_RB3                     1902
#define TRISB3                        1903
#define TRISB_RB4                     1904
#define TRISB4                        1905
#define TRISB_RB5                     1906
#define TRISB5                        1907
#define TRISB_RB6                     1908
#define TRISB6                        1909
#define TRISB_RB7                     1910
#define TRISB7                        1911
#define TRISC                         1912
#define TRISC0                        1913
#define TRISC_RC0                     1914
#define TRISC1                        1915
#define TRISC_RC1                     1916
#define TRISC2                        1917
#define TRISC_RC2                     1918
#define TRISC3                        1919
#define TRISC_RC3                     1920
#define TRISC4                        1921
#define TRISC_RC4                     1922
#define TRISC5                        1923
#define TRISC_RC5                     1924
#define TRISC6                        1925
#define TRISC_RC6                     1926
#define TRISC7                        1927
#define TRISC_RC7                     1928
#define TRISD                         1929
#define TRISD_RD0                     1930
#define TRISD0                        1931
#define TRISD_RD1                     1932
#define TRISD1                        1933
#define TRISD_RD2                     1934
#define TRISD2                        1935
#define TRISD_RD3                     1936
#define TRISD3                        1937
#define TRISD_RD4                     1938
#define TRISD4                        1939
#define TRISD_RD5                     1940
#define TRISD5                        1941
#define TRISD_RD6                     1942
#define TRISD6                        1943
#define TRISD_RD7                     1944
#define TRISD7                        1945
#define TRISE                         1946
#define TRISE_RE0                     1947
#define TRISE0                        1948
#define TRISE1                        1949
#define TRISE_RE1                     1950
#define TRISE2                        1951
#define TRISE_RE2                     1952
#define TRISE_RE3                     1953
#define TRISE3                        1954
#define TRISE_RE4                     1955
#define TRISE4                        1956
#define TRISE_RE5                     1957
#define TRISE5                        1958
#define TRISE_RE6                     1959
#define TRISE6                        1960
#define TRISE_RE7                     1961
#define TRISE7                        1962
#define TRISF                         1963
#define TRISF0                        1964
#define TRISF_RF0                     1965
#define TRISF_RF1                     1966
#define TRISF1                        1967
#define TRISF_RF2                     1968
#define TRISF2                        1969
#define TRISF3                        1970
#define TRISF_RF3                     1971
#define TRISF_RF4                     1972
#define TRISF4                        1973
#define TRISF_RF5                     1974
#define TRISF5                        1975
#define TRISF_RF6                     1976
#define TRISF6                        1977
#define TRISF7                        1978
#define TRISF_RF7                     1979
#define TRISG                         1980
#define TRISG0                        1981
#define TRISG_RG0                     1982
#define TRISG1                        1983
#define TRISG_RG1                     1984
#define TRISG2                        1985
#define TRISG_RG2                     1986
#define TRISG_RG3                     1987
#define TRISG3                        1988
#define TRISG4                        1989
#define TRISG_RG4                     1990
#define TRISH                         1991
#define TRISH_RH0                     1992
#define TRISH0                        1993
#define TRISH_RH1                     1994
#define TRISH1                        1995
#define TRISH_RH2                     1996
#define TRISH2                        1997
#define TRISH_RH3                     1998
#define TRISH3                        1999
#define TRISH_RH4                     2000
#define TRISH4                        2001
#define TRISH_RH5                     2002
#define TRISH5                        2003
#define TRISH_RH6                     2004
#define TRISH6                        2005
#define TRISH_RH7                     2006
#define TRISH7                        2007
#define TRISJ                         2008
#define TRISJ_RJ0                     2009
#define TRISJ0                        2010
#define TRISJ_RJ1                     2011
#define TRISJ1                        2012
#define TRISJ_RJ2                     2013
#define TRISJ2                        2014
#define TRISJ_RJ3                     2015
#define TRISJ3                        2016
#define TRISJ_RJ4                     2017
#define TRISJ4                        2018
#define TRISJ_RJ5                     2019
#define TRISJ5                        2020
#define TRISJ_RJ6                     2021
#define TRISJ6                        2022
#define TRISJ_RJ7                     2023
#define TRISJ7                        2024
#define PIE1                          2025
#define TMR1IE                        2026
#define TMR2IE                        2027
#define CCP1IE                        2028
#define SSPIE                         2029
#define TXIE                          2030
#define TX1IE                         2031
#define RCIE                          2032
#define RC1IE                         2033
#define ADIE                          2034
#define PSPIE                         2035
#define PIR1                          2036
#define TMR1IF                        2037
#define TMR2IF                        2038
#define CCP1IF                        2039
#define SSPIF                         2040
#define TXIF                          2041
#define TX1IF                         2042
#define RCIF                          2043
#define RC1IF                         2044
#define ADIF                          2045
#define PSPIF                         2046
#define IPR1                          2047
#define TMR1IP                        2048
#define TMR2IP                        2049
#define CCP1IP                        2050
#define SSPIP                         2051
#define TX1IP                         2052
#define TXIP                          2053
#define RC1IP                         2054
#define RCIP                          2055
#define ADIP                          2056
#define PSPIP                         2057
#define PIE2                          2058
#define CCP2IE                        2059
#define TMR3IE                        2060
#define LVDIE                         2061
#define BCLIE                         2062
#define CMIE                          2063
#define PIR2                          2064
#define CCP2IF                        2065
#define TMR3IF                        2066
#define LVDIF                         2067
#define BCLIF                         2068
#define CMIF                          2069
#define IPR2                          2070
#define CCP2IP                        2071
#define TMR3IP                        2072
#define LVDIP                         2073
#define BCLIP                         2074
#define CMIP                          2075
#define PIE3                          2076
#define RXB0IE                        2077
#define RXBNIE                        2078
#define RXB1IE                        2079
#define TXB0IE                        2080
#define TXB1IE                        2081
#define TXB2IE                        2082
#define TXBNIE                        2083
#define ERRIE                         2084
#define WAKIE                         2085
#define IRXIE                         2086
#define PIR3                          2087
#define RXB0IF                        2088
#define RXBNIF                        2089
#define RXB1IF                        2090
#define TXB0IF                        2091
#define TXB1IF                        2092
#define TXB2IF                        2093
#define TXBNIF                        2094
#define ERRIF                         2095
#define WAKIF                         2096
#define IRXIF                         2097
#define IPR3                          2098
#define RXB0IP                        2099
#define RXB1IP                        2100
#define RXBNIP                        2101
#define TXB0IP                        2102
#define TXB1IP                        2103
#define TXB2IP                        2104
#define TXBNIP                        2105
#define ERRIP                         2106
#define WAKIP                         2107
#define IRXIP                         2108
#define RCSTA                         2109
#define RCD8                          2110
#define RX9D                          2111
#define OERR                          2112
#define FERR                          2113
#define ADDEN                         2114
#define ADEN                          2115
#define CREN                          2116
#define SRENA                         2117
#define SREN                          2118
#define RC9                           2119
#define RC8_9                         2120
#define RX9                           2121
#define SPEN                          2122
#define TXSTA                         2123
#define TXD8                          2124
#define TX9D1                         2125
#define TX9D                          2126
#define TRMT                          2127
#define TRMT1                         2128
#define BRGH1                         2129
#define BRGH                          2130
#define SYNC                          2131
#define SYNC1                         2132
#define TXEN1                         2133
#define TXEN                          2134
#define TX91                          2135
#define TX8_9                         2136
#define TX9                           2137
#define CSRC1                         2138
#define CSRC                          2139
#define PSPCON                        2140
#define PSPMODE                       2141
#define IBOV                          2142
#define OBF                           2143
#define IBF                           2144
#define T3CON                         2145
#define TMR3ON                        2146
#define TMR3CS                        2147
#define nT3SYNC                       2148
#define NOT_T3SYNC                    2149
#define T3SYNC                        2150
#define T3INSYNC                      2151
#define SOSCEN3                       2152
#define T3CCP1                        2153
#define T3CKPS                        2154
#define T3CKPS0                       2155
#define T3CKPS1                       2156
#define T3CCP2                        2157
#define T3CON_RD16                    2158
#define RD163                         2159
#define T3RD16                        2160
#define CMCON                         2161
#define CM                            2162
#define CMEN0                         2163
#define CM0                           2164
#define CMEN1                         2165
#define CM1                           2166
#define CMEN2                         2167
#define CM2                           2168
#define CIS                           2169
#define C1INV                         2170
#define C2INV                         2171
#define C1OUT                         2172
#define C2OUT                         2173
#define CVRCON                        2174
#define VR                            2175
#define VR0                           2176
#define CVR0                          2177
#define VR1                           2178
#define CVR1                          2179
#define VR2                           2180
#define CVR2                          2181
#define VR3                           2182
#define CVR3                          2183
#define CVRSS                         2184
#define VRSS                          2185
#define VRR                           2186
#define CRR                           2187
#define CVRR                          2188
#define VROEN                         2189
#define CVROEN                        2190
#define VROE                          2191
#define VREN                          2192
#define CVREN                         2193
#define CCP2CON                       2194
#define CCP2M                         2195
#define CCP2M0                        2196
#define CCP2M1                        2197
#define CCP2M2                        2198
#define CCP2CON_CCPM3                 2199
#define CCP2M3                        2200
#define DC2B0                         2201
#define CCP2Y                         2202
#define DC2B                          2203
#define DC2B1                         2204
#define CCP2X                         2205
#define DCCPX                         2206
