tiborsimon/embedded-tdd-headers/pic/pic18/pic18c858_tdd.h
#define CCP1CON                       2207
#define CCP1M0                        2208
#define CCP1M                         2209
#define CCP1M1                        2210
#define CCP1M2                        2211
#define CCP1M3                        2212
#define CCP1CON_CCPM3                 2213
#define CCP1Y                         2214
#define DC1B                          2215
#define DC1B0                         2216
#define CCP1X                         2217
#define DC1B1                         2218
#define ADCON2                        2219
#define ADCS                          2220
#define ADCS0                         2221
#define ADCS1                         2222
#define ADCS2                         2223
#define ADFM                          2224
#define ADCON1                        2225
#define PCFG0                         2226
#define PCFG                          2227
#define PCFG1                         2228
#define PCFG2                         2229
#define CHSN3                         2230
#define PCFG3                         2231
#define VCFG                          2232
#define VCFG0                         2233
#define VCFG01                        2234
#define VCFG11                        2235
#define VCFG1                         2236
#define ADCON0                        2237
#define ADON                          2238
#define nDONE                         2239
#define GO_nDONE                      2240
#define NOT_DONE                      2241
#define GODONE                        2242
#define GO_DONE                       2243
#define DONE                          2244
#define GO_NOT_DONE                   2245
#define GO                            2246
#define CHS                           2247
#define CHS0                          2248
#define CHS1                          2249
#define CHS2                          2250
#define CHS3                          2251
#define SSPCON2                       2252
#define SEN                           2253
#define RSEN                          2254
#define PEN                           2255
#define RCEN                          2256
#define ACKEN                         2257
#define ACKDT                         2258
#define ACKSTAT                       2259
#define GCEN                          2260
#define SSPCON1                       2261
#define SSPM0                         2262
#define SSPM                          2263
#define SSPM1                         2264
#define SSPM2                         2265
#define SSPM3                         2266
#define CKP                           2267
#define SSPEN                         2268
#define SSPOV                         2269
#define WCOL                          2270
#define SSPSTAT                       2271
#define BF                            2272
#define UA                            2273
#define R_NOT_W                       2274
#define READ_WRITE                    2275
#define NOT_W                         2276
#define R_W                           2277
#define RW                            2278
#define R                             2279
#define NOT_WRITE                     2280
#define nW                            2281
#define nWRITE                        2282
#define R_nW                          2283
#define I2C_READ                      2284
#define START                         2285
#define S                             2286
#define I2C_START                     2287
#define STOP                          2288
#define I2C_STOP                      2289
#define P                             2290
#define NOT_A                         2291
#define I2C_DATA                      2292
#define nA                            2293
#define D_nA                          2294
#define D                             2295
#define DA                            2296
#define DATA_ADDRESS                  2297
#define D_A                           2298
#define D_NOT_A                       2299
#define NOT_ADDRESS                   2300
#define nADDRESS                      2301
#define I2C_DAT                       2302
#define CKE                           2303
#define SMP                           2304
#define T2CON                         2305
#define T2CKPS0                       2306
#define T2CKPS                        2307
#define T2CKPS1                       2308
#define TMR2ON                        2309
#define TOUTPS0                       2310
#define TOUTPS                        2311
#define TOUTPS1                       2312
#define TOUTPS2                       2313
#define TOUTPS3                       2314
#define PR2                           2315
#define WM0                           2316
#define WM1                           2317
#define WAIT0                         2318
#define WAIT1                         2319
#define EBDIS                         2320
#define T1CON                         2321
#define TMR1ON                        2322
#define TMR1CS                        2323
#define NOT_T1SYNC                    2324
#define T1SYNC                        2325
#define nT1SYNC                       2326
#define T1INSYNC                      2327
#define T1OSCEN                       2328
#define SOSCEN                        2329
#define T1CKPS0                       2330
#define T1CKPS                        2331
#define T1CKPS1                       2332
#define T1RD16                        2333
#define T1CON_RD16                    2334
#define RCON                          2335
#define BOR                           2336
#define NOT_BOR                       2337
#define nBOR                          2338
#define POR                           2339
#define nPOR                          2340
#define NOT_POR                       2341
#define nPD                           2342
#define NOT_PD                        2343
#define PD                            2344
#define TO                            2345
#define NOT_TO                        2346
#define nTO                           2347
#define nRI                           2348
#define NOT_RI                        2349
#define RI                            2350
#define NOT_LWRT                      2351
#define nLWRT                         2352
#define LWRT                          2353
#define IPEN                          2354
#define NOT_IPEN                      2355
#define nIPEN                         2356
#define WDTCON                        2357
#define SWDTE                         2358
#define SWDTEN                        2359
#define LVDCON                        2360
#define LVDL0                         2361
#define LVDL                          2362
#define LVDL1                         2363
#define LVDL2                         2364
#define LVDL3                         2365
#define LVDEN                         2366
#define IRVST                         2367
#define OSCCON                        2368
#define SCS                           2369
#define T0CON                         2370
#define T0PS                          2371
#define T0PS0                         2372
#define T0PS1                         2373
#define T0PS2                         2374
#define PSA                           2375
#define T0PS3                         2376
#define T0SE                          2377
#define T0CS                          2378
#define T08BIT                        2379
#define T016BIT                       2380
#define TMR0ON                        2381
#define STATUS                        2382
#define C                             2383
#define CARRY                         2384
#define DC                            2385
#define ZERO                          2386
#define Z                             2387
#define OV                            2388
#define OVERFLOW                      2389
#define N                             2390
#define NEGATIVE                      2391
#define INTCON3                       2392
#define INT1IF                        2393
#define INT1F                         2394
#define INT2IF                        2395
#define INT2F                         2396
#define INT3F                         2397
#define INT3IF                        2398
#define INT1E                         2399
#define INT1IE                        2400
#define INT2IE                        2401
#define INT2E                         2402
#define INT3E                         2403
#define INT3IE                        2404
#define INT1P                         2405
#define INT1IP                        2406
#define INT2IP                        2407
#define INT2P                         2408
#define INTCON2                       2409
#define RBIP                          2410
#define INT3IP                        2411
#define INT3P                         2412
#define TMR0IP                        2413
#define T0IP                          2414
#define INTEDG3                       2415
#define INTEDG2                       2416
#define INTEDG1                       2417
#define INTEDG0                       2418
#define RBPU                          2419
#define NOT_RBPU                      2420
#define nRBPU                         2421
#define INTCON                        2422
#define RBIF                          2423
#define INT0F                         2424
#define INT0IF                        2425
#define T0IF                          2426
#define TMR0IF                        2427
#define RBIE                          2428
#define INT0E                         2429
#define INT0IE                        2430
#define T0IE                          2431
#define TMR0IE                        2432
#define PEIE                          2433
#define PEIE_GIEL                     2434
#define GIEL                          2435
#define GIE_GIEH                      2436
#define GIE                           2437
#define GIEH                          2438
#define STKPTR0                       2439
#define STKPTR                        2440
#define SP0                           2441
#define STKPTR1                       2442
#define SP1                           2443
#define STKPTR2                       2444
#define SP2                           2445
#define SP3                           2446
#define STKPTR3                       2447
#define STKPTR4                       2448
#define SP4                           2449
#define STKUNF                        2450
#define STKOVF                        2451
#define STKFUL                        2452

#endif // _PIC18C858_H_
